app/views/static_pages/landing_page.html.haml

    %h1s
    = Course.count
---
SELECT COUNT(*) FROM "courses"

    %h1
    = Course.distinct.count(:user_id)
---
SELECT COUNT(DISTINCT "courses"."user_id") FROM "courses"

    %h1
    = User.count
---
SELECT COUNT(*) FROM "users"