app/views/users/_user.html.haml

SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1  [["user_id", 1]]
---
    .card-footer
      - user.roles.each do |role|