app/views/courses/_course.html.haml

    Lições:
    = course.lessons.count
---
SELECT COUNT(*) FROM "lessons" WHERE "lessons"."course_id" = $1  [["course_id", 4]]