app/views/courses/index.html.haml

      = f.label :nivel
      = f.select :nivel_cont, Course.niveis, include_blank: true
---
SELECT "courses".* FROM "courses" WHERE "courses"."nivel" ILIKE '%Intermediario%'