app/controllers/courses_controller.rb

  def index
    @courses = Course.all
    if params[:titulo]
      @courses = Course.where('titulo ILIKE ?', "%#{params[:titulo]}%") #case-insensitive
    else
      #@courses = Course.all
      @q = Course.ransack(params[:q])
      @courses = @q.result.includes(:user)
---
SELECT "courses".* FROM "courses" WHERE (titulo ILIKE '%art %')
SELECT "courses".* FROM "courses" WHERE "courses"."titulo" ILIKE '%Education%'
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]

  def create
    @course = Course.new(course_params)
    @course.user = current_user

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("titulo", "descricao", "created_at", "updated_at", "user_id", "slug", "linguagens", "nivel") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "titulo" = $1, "descricao" = $2, "updated_at" = $3 WHERE "courses"."id" = $4  [["titulo", "dasbcjaksbcibviu 281729 abc"], ["descricao", "sadadsnsajkdbsa"], ["updated_at", "2022-11-18 18:47:13.628352"], ["id", 11]]

    def set_course
      @course = Course.friendly.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]