app/controllers/lessons_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "lessons" ("titulo", "conteudo", "course_id", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["titulo", "sdadsad"], ["conteudo", "csxcasdc\r\n"], ["course_id", 4], ["created_at", "2022-11-18 18:38:23.138460"], ["updated_at", "2022-11-18 18:38:23.138460"], ["slug", "sdadsad"]]
---
  def create
    @lesson = Lesson.new(lesson_params)
    @course = Course.friendly.find(params[:course_id])
    @lesson.course_id = @course.id
    authorize @lesson
    respond_to do |format|
      if @lesson.save

UPDATE "lessons" SET "titulo" = $1, "updated_at" = $2 WHERE "lessons"."id" = $3  [["titulo", "sdadsad xxxxx"], ["updated_at", "2022-11-18 18:40:12.087072"], ["id", 14]]
---
  def update
    authorize @lesson
    respond_to do |format|
      if @lesson.update(lesson_params)

DELETE FROM "lessons" WHERE "lessons"."id" = $1  [["id", 15]]
---
  def destroy
    authorize @lesson
    @lesson.destroy

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_lesson
      @course = Course.friendly.find(params[:course_id])
      @lesson = Lesson.friendly.find(params[:id])