app/controllers/static_pages_controller.rb

SELECT "courses".* FROM "courses" ORDER BY "courses"."created_at" DESC LIMIT $1  [["LIMIT", 3]]
---
    def landing_page
        @courses = Course.all.limit(3)

SELECT "activities".* FROM "activities"
---
    def activity
        @activities = PublicActivity::Activity.all