app/models/user.rb

  def assign_default_role
    if User.count == 1
      self.add_role(:admin) if self.roles.blank?
---
SELECT COUNT(*) FROM "users"
SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1  [["user_id", 4]]